23) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:94    [M] TrueValue

--- Original
+++ New
@@ @@
                 }
                 continue;
             }
-            if (true === $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
+            if (false === $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
                 if ($config->isDryRun()) {
                     $io->write('<fg=yellow>[READY]</> ');
                 } else {

24) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:94    [M] Identical

--- Original
+++ New
@@ @@
                 }
                 continue;
             }
-            if (true === $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
+            if (true !== $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
                 if ($config->isDryRun()) {
                     $io->write('<fg=yellow>[READY]</> ');
                 } else {

25) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:94    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 }
                 continue;
             }
-            if (true === $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
+            if (true === $pullRequest->isMergeable() || $pullRequest->isCleanBuild()) {
                 if ($config->isDryRun()) {
                     $io->write('<fg=yellow>[READY]</> ');
                 } else {

26) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:96    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             if (true === $pullRequest->isMergeable() && $pullRequest->isCleanBuild()) {
                 if ($config->isDryRun()) {
-                    $io->write('<fg=yellow>[READY]</> ');
+                    
                 } else {
                     $this->pullRequests->merge($repository, $pullRequest, $config->isSquash());
                     $io->write('<fg=green>[MERGED]</> ');

27) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:98    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if ($config->isDryRun()) {
                     $io->write('<fg=yellow>[READY]</> ');
                 } else {
-                    $this->pullRequests->merge($repository, $pullRequest, $config->isSquash());
+                    
                     $io->write('<fg=green>[MERGED]</> ');
                 }
             } else {

28) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     $io->write('<fg=yellow>[READY]</> ');
                 } else {
                     $this->pullRequests->merge($repository, $pullRequest, $config->isSquash());
-                    $io->write('<fg=green>[MERGED]</> ');
+                    
                 }
             } else {
                 $io->write('<fg=red>[ERROR]</> ');

29) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:103    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                     $io->write('<fg=green>[MERGED]</> ');
                 }
             } else {
-                $io->write('<fg=red>[ERROR]</> ');
+                
             }
             $io->write(sprintf('<href=%s>%s</> - %s', $pullRequest->htmlUrl(), $pullRequest->issue()->toInt(), $pullRequest->title()));
             $io->newLine();

30) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:106    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } else {
                 $io->write('<fg=red>[ERROR]</> ');
             }
-            $io->write(sprintf('<href=%s>%s</> - %s', $pullRequest->htmlUrl(), $pullRequest->issue()->toInt(), $pullRequest->title()));
+            
             $io->newLine();
         }
         return self::SUCCESS;
     }
 }

31) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Command/MergeCommand.php:108    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $io->write('<fg=red>[ERROR]</> ');
             }
             $io->write(sprintf('<href=%s>%s</> - %s', $pullRequest->htmlUrl(), $pullRequest->issue()->toInt(), $pullRequest->title()));
-            $io->newLine();
+            
         }
         return self::SUCCESS;
     }
 }

32) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function __construct(array $options)
     {
         Assert::keyExists($options, 'repository');
-        Assert::stringNotEmpty($options['repository']);
+        
         Assert::nullOrString($options['label']);
         Assert::nullOrString($options['ignore-label']);
         Assert::nullOrBoolean($options['squash']);

33) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         Assert::keyExists($options, 'repository');
         Assert::stringNotEmpty($options['repository']);
-        Assert::nullOrString($options['label']);
+        
         Assert::nullOrString($options['ignore-label']);
         Assert::nullOrBoolean($options['squash']);
         Assert::nullOrBoolean($options['dry-run']);

34) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::keyExists($options, 'repository');
         Assert::stringNotEmpty($options['repository']);
         Assert::nullOrString($options['label']);
-        Assert::nullOrString($options['ignore-label']);
+        
         Assert::nullOrBoolean($options['squash']);
         Assert::nullOrBoolean($options['dry-run']);
         $this->repository = $options['repository'];

35) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::stringNotEmpty($options['repository']);
         Assert::nullOrString($options['label']);
         Assert::nullOrString($options['ignore-label']);
-        Assert::nullOrBoolean($options['squash']);
+        
         Assert::nullOrBoolean($options['dry-run']);
         $this->repository = $options['repository'];
         $this->label = $options['label'] ?? $this->label;

36) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::nullOrString($options['label']);
         Assert::nullOrString($options['ignore-label']);
         Assert::nullOrBoolean($options['squash']);
-        Assert::nullOrBoolean($options['dry-run']);
+        
         $this->repository = $options['repository'];
         $this->label = $options['label'] ?? $this->label;
         $this->ignoreLabel = $options['ignore-label'] ?? $this->ignoreLabel;

37) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:48    [M] Coalesce

--- Original
+++ New
@@ @@
         Assert::nullOrBoolean($options['squash']);
         Assert::nullOrBoolean($options['dry-run']);
         $this->repository = $options['repository'];
-        $this->label = $options['label'] ?? $this->label;
+        $this->label = $this->label ?? $options['label'];
         $this->ignoreLabel = $options['ignore-label'] ?? $this->ignoreLabel;
         $this->squash = $options['squash'] ?? $this->squash;
         $this->dryRun = $options['dry-run'] ?? $this->dryRun;

38) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:49    [M] Coalesce

--- Original
+++ New
@@ @@
         Assert::nullOrBoolean($options['dry-run']);
         $this->repository = $options['repository'];
         $this->label = $options['label'] ?? $this->label;
-        $this->ignoreLabel = $options['ignore-label'] ?? $this->ignoreLabel;
+        $this->ignoreLabel = $this->ignoreLabel ?? $options['ignore-label'];
         $this->squash = $options['squash'] ?? $this->squash;
         $this->dryRun = $options['dry-run'] ?? $this->dryRun;
     }

39) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:50    [M] Coalesce

--- Original
+++ New
@@ @@
         $this->repository = $options['repository'];
         $this->label = $options['label'] ?? $this->label;
         $this->ignoreLabel = $options['ignore-label'] ?? $this->ignoreLabel;
-        $this->squash = $options['squash'] ?? $this->squash;
+        $this->squash = $this->squash ?? $options['squash'];
         $this->dryRun = $options['dry-run'] ?? $this->dryRun;
     }
     /**

40) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:51    [M] Coalesce

--- Original
+++ New
@@ @@
         $this->label = $options['label'] ?? $this->label;
         $this->ignoreLabel = $options['ignore-label'] ?? $this->ignoreLabel;
         $this->squash = $options['squash'] ?? $this->squash;
-        $this->dryRun = $options['dry-run'] ?? $this->dryRun;
+        $this->dryRun = $this->dryRun ?? $options['dry-run'];
     }
     /**
      * @param array<string, mixed> $options

41) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($options);
     }
-    public function repository() : string
+    protected function repository() : string
     {
         return $this->repository;
     }

42) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->repository;
     }
-    public function label() : string
+    protected function label() : string
     {
         return $this->label;
     }

43) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->label;
     }
-    public function ignoreLabel() : string
+    protected function ignoreLabel() : string
     {
         return $this->ignoreLabel;
     }

44) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:77    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->ignoreLabel;
     }
-    public function isSquash() : bool
+    protected function isSquash() : bool
     {
         return $this->squash;
     }

45) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Config/Configuration.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->squash;
     }
-    public function isDryRun() : bool
+    protected function isDryRun() : bool
     {
         return $this->dryRun;
     }
 }

46) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Domain/Head.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->sha;
     }
-    public function toString() : string
+    protected function toString() : string
     {
         return $this->ref;
     }
 }

47) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Domain/PullRequest.php:161    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->mergeable;
     }
-    public function mergeableState() : string
+    protected function mergeableState() : string
     {
         return $this->mergeableState;
     }

48) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Domain/PullRequest.php:166    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->mergeableState;
     }
-    public function isCleanBuild() : bool
+    protected function isCleanBuild() : bool
     {
         return 'clean' === $this->mergeableState;
     }

49) /Users/gripp/Development/Web/lib/nucleos/auto-merge-action/src/Domain/PullRequest.php:168    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isCleanBuild() : bool
     {
-        return 'clean' === $this->mergeableState;
+        return 'clean' !== $this->mergeableState;
     }
     public function htmlUrl() : string
     {
